In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
df = pd.read_csv('cleaned_data_final.csv')

In [3]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost/final_proj'
# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)
# Establish a connection
connection = engine.connect()

In [4]:
df.head()

,id,dateAdded,dateUpdated,brand,categories,primaryCategories,colors,ean / upc,imageURLs,manufacturer,manufacturerNumber,name,prices.amountMax,prices.color,prices.dateSeen,prices.offer,prices.size,prices.sourceURLs,sizes,sourceURLs
0,AWpyySsJAGTnQPR7wNt4,2019-05-01T09:27:22Z,2019-05-01T09:27:22Z,City Classified,"Clothing,Shoes,Womens Shoes,All Womens Shoes",Shoes,Black,6.560000e+11,https://i5.walmartimages.com/asr/f0dc6cbd-fa38...,NaN,NaN,City Classified Stylish-S Womens Zipper Ankle ...,29.95,Black,2019-04-19T07:09:29Z,Online only,8.0,https://www.walmart.com/ip/City-Classified-Sty...,8,https://www.walmart.com/ip/City-Classified-Sty...
1,AWpyyyb3AGTnQPR7wN-u,2019-05-01T09:27:19Z,2019-05-01T09:27:19Z,Skechers,"Clothing,Shoes,Womens Shoes,All Womens Shoes",Shoes,Taupe,1.920000e+11,NaN,NaN,NaN,"Skechers WomenS You Radiate, Walking",84.00,Taupe,2019-04-24T09:14:11Z,Online only,6.0,https://www.walmart.com/ip/Skechers-Women-S-Yo...,6 M US,https://www.walmart.com/ip/Skechers-Women-S-Yo...
2,AWpyzlajAGTnQPR7wOX8,2019-05-01T09:26:59Z,2019-05-01T09:26:59Z,Floral,"Clothing,Shoes,Womens Shoes,All Womens Shoes",Shoes,Black,7.090000e+11,NaN,NaN,NaN,FLORAL Pearl Womens Wide Width Evening Dress S...,49.95,Black,2019-04-25T12:35:00.000Z,Online only,5.0,https://www.walmart.com/ip/FLORAL-Pearl-Women-...,5,https://www.walmart.com/ip/FLORAL-Pearl-Women-...
3,AWpyxomE0U_gzG0hkA1q,2019-05-01T09:26:56Z,2019-05-01T09:26:56Z,Jambu,"Clothing,Shoes,Womens Shoes,All Womens Shoes",Shoes,Black/Multi,8.840000e+11,https://i5.walmartimages.com/asr/bf04e7cf-0f7b...,NaN,NaN,Womens Jambu Amal Water Resistant Bootie,127.20,Black/Multi,2019-04-30T19:49:00.000Z,Online only: 20% off,9.5,https://www.walmart.com/ip/Jambu-Women-s-AMAL-...,9.5 BM US,https://www.walmart.com/ip/Jambu-Women-s-AMAL-...
4,AWpyxChWJbEilcB6RhWx,2019-05-01T09:26:56Z,2019-05-01T09:26:56Z,Trotters,"Clothing,Shoes,Womens Shoes,All Womens Shoes",Shoes,White,8.870000e+11,NaN,NaN,NaN,"trotters womens blast iii boot,black quill,11 ...",47.66,White,2019-04-19T07:07:46Z,Online only: 50% off,11.0,https://www.walmart.com/ip/Women-s-Trotters-Bl...,11,https://www.walmart.com/ip/Women-s-Trotters-Bl...

In [11]:
#get subset of df, rename columns, drop duplicate item IDs, and populate "items" table
items_df = df[['id', 'name', 'prices.amountMax']]
items_df.columns = ['item_id', 'item_name', 'price']
items_df = items_df.drop_duplicates(subset = ["item_id"])
items_df.to_sql(name='items', con=engine, if_exists='append', index=False)
items_df.head()

,item_id,item_name,price
0,AWpyySsJAGTnQPR7wNt4,City Classified Stylish-S Womens Zipper Ankle ...,29.95
1,AWpyyyb3AGTnQPR7wN-u,"Skechers WomenS You Radiate, Walking",84.00
2,AWpyzlajAGTnQPR7wOX8,FLORAL Pearl Womens Wide Width Evening Dress S...,49.95
3,AWpyxomE0U_gzG0hkA1q,Womens Jambu Amal Water Resistant Bootie,127.20
4,AWpyxChWJbEilcB6RhWx,"trotters womens blast iii boot,black quill,11 ...",47.66

In [12]:
#get subset of df, rename columns, get unique sizes, add size_id, and populate "size" table
size_df = df[['prices.size']]
size_df.columns = ['prices_size']
size_df = pd.DataFrame(size_df.prices_size.unique(), columns=['size_name'])
size_df.insert(0, 'size_id', range(1, 1 + len(size_df)))
size_df.to_sql(name='size', con=engine, if_exists='append', index=False)
size_df.head()

   size_id  size_name
0        1        8.0
1        2        6.0
2        3        5.0
3        4        9.5
4        5       11.0

In [15]:
#get subset of df, rename columns, and populate "item_sources" table
item_sources_df = df[['id', 'sourceURLs']]
item_sources_df.columns = ['item_id', 'url']
item_sources_df.to_sql(name='item_sources', con=engine, if_exists='append', index=False)
item_sources_df.head()

                item_id                                                url
0  AWpyySsJAGTnQPR7wNt4  https://www.walmart.com/ip/City-Classified-Sty...
1  AWpyyyb3AGTnQPR7wN-u  https://www.walmart.com/ip/Skechers-Women-S-Yo...
2  AWpyzlajAGTnQPR7wOX8  https://www.walmart.com/ip/FLORAL-Pearl-Women-...
3  AWpyxomE0U_gzG0hkA1q  https://www.walmart.com/ip/Jambu-Women-s-AMAL-...
4  AWpyxChWJbEilcB6RhWx  https://www.walmart.com/ip/Women-s-Trotters-Bl...

In [16]:
#get subset of df, rename columns, and populate "item_imageURL" table
item_imageURL_df = df[['id', 'imageURLs']]
item_imageURL_df.columns = ['item_id', 'imageurl']
item_imageURL_df.to_sql(name='item_imageurl', con=engine, if_exists='append', index=False)
item_imageURL_df.head()

                item_id                                           imageurl
0  AWpyySsJAGTnQPR7wNt4  https://i5.walmartimages.com/asr/f0dc6cbd-fa38...
1  AWpyyyb3AGTnQPR7wN-u                                                NaN
2  AWpyzlajAGTnQPR7wOX8                                                NaN
3  AWpyxomE0U_gzG0hkA1q  https://i5.walmartimages.com/asr/bf04e7cf-0f7b...
4  AWpyxChWJbEilcB6RhWx                                                NaN

In [17]:
#get subset of df, rename columns, and populate "item_date" table
item_date_df = df[['id', 'dateAdded', 'dateUpdated']]
item_date_df.columns = ['item_id', 'date_added', 'date_updated']
item_date_df.to_sql(name='item_date', con=engine, if_exists='append', index=False)
item_date_df.head()

                item_id            date_added          date_updated
0  AWpyySsJAGTnQPR7wNt4  2019-05-01T09:27:22Z  2019-05-01T09:27:22Z
1  AWpyyyb3AGTnQPR7wN-u  2019-05-01T09:27:19Z  2019-05-01T09:27:19Z
2  AWpyzlajAGTnQPR7wOX8  2019-05-01T09:26:59Z  2019-05-01T09:26:59Z
3  AWpyxomE0U_gzG0hkA1q  2019-05-01T09:26:56Z  2019-05-01T09:26:56Z
4  AWpyxChWJbEilcB6RhWx  2019-05-01T09:26:56Z  2019-05-01T09:26:56Z

In [23]:
#get subset of df, rename columns, and populate "item_size" table
item_size_df = df[['prices.size']] 
item_size_df = pd.concat([df['id'], item_size_df], axis = 1)
item_size_df = item_size_df.melt(id_vars = 'id').drop('variable', axis = 1) #pivot longer so that each row is item-category
item_size_df.columns = ['item_id', 'size_name']
item_size_df = item_size_df.dropna()
item_size_df = pd.merge(item_size_df, size_df, how="left", on = 'size_name') #left join with size_df to get size_id
item_size_df = item_size_df.drop(columns=['size_name']) #drop size column
item_size_df.to_sql(name='item_size', con=engine, if_exists='append', index=False)
item_size_df.head()

                item_id  size_id
0  AWpyySsJAGTnQPR7wNt4        1
1  AWpyyyb3AGTnQPR7wN-u        2
2  AWpyzlajAGTnQPR7wOX8        3
3  AWpyxomE0U_gzG0hkA1q        4
4  AWpyxChWJbEilcB6RhWx        5

In [24]:
#brand
brand_df = df[['brand']]
brand_df.columns = ['brands']
brand_df = pd.DataFrame(brand_df.brands.unique(), columns=['brand_name'])
brand_df.insert(0, 'brand_id', range(1, 1 + len(brand_df)))
brand_df.to_sql(name='brands', con=engine, if_exists='append', index=False)
brand_df.head()

   brand_id       brand_name
0         1  City Classified
1         2         Skechers
2         3           Floral
3         4            Jambu
4         5         Trotters

In [25]:
#item_brand
item_brand_df = df[['brand']]
item_brand_df = pd.concat([df['id'], item_brand_df], axis = 1)
item_brand_df = item_brand_df.melt(id_vars = 'id').drop('variable', axis = 1)
item_brand_df.columns = ['item_id', 'brand']
item_brand_df = item_brand_df.dropna()
item_brand_df = pd.merge(item_brand_df, brand_df, how="left", left_on = 'brand', right_on = 'brand_name') 
item_brand_df = item_brand_df.drop(columns=['brand', 'brand_name']) #drop brand name columns
item_brand_df.to_sql(name='item_brand', con=engine, if_exists='append', index=False)
item_brand_df.head()

                item_id  brand_id
0  AWpyySsJAGTnQPR7wNt4         1
1  AWpyyyb3AGTnQPR7wN-u         2
2  AWpyzlajAGTnQPR7wOX8         3
3  AWpyxomE0U_gzG0hkA1q         4
4  AWpyxChWJbEilcB6RhWx         5

In [26]:
#colors
colors_df = df[['colors']]
colors_df = pd.DataFrame(colors_df.colors.unique(), columns=['color_name'])
colors_df.insert(0, 'color_id', range(1, 1 + len(colors_df)))
colors_df.to_sql(name='colors', con=engine, if_exists='append', index=False)
colors_df.head()

   color_id                   color_name
0         1                        Black
1         2                        Taupe
2         3                  Black/Multi
3         4                        White
4         5  Metallic Multi Soft Leather

In [27]:
#item_color
item_color_df = df[['colors']]
item_color_df = pd.concat([df['id'], item_color_df], axis = 1)
item_color_df = item_color_df.melt(id_vars = 'id').drop('variable', axis = 1)
item_color_df.columns = ['item_id', 'colors']
item_color_df = item_color_df.dropna()
item_color_df = pd.merge(item_color_df, colors_df, how="left", left_on = 'colors', right_on = 'color_name') 
item_color_df = item_color_df.drop(columns=['colors', 'color_name']) #drop colors column
item_color_df.to_sql(name='item_color', con=engine, if_exists='append', index=False)
item_color_df.head()

                item_id  color_id
0  AWpyySsJAGTnQPR7wNt4         1
1  AWpyyyb3AGTnQPR7wN-u         2
2  AWpyzlajAGTnQPR7wOX8         1
3  AWpyxomE0U_gzG0hkA1q         3
4  AWpyxChWJbEilcB6RhWx         4

In [29]:
#manufacturer
manufacturer_df = df[['manufacturer']]
manufacturer_df = pd.DataFrame(manufacturer_df.manufacturer.unique(), columns=['manufacturer_name'])
manufacturer_df = manufacturer_df.dropna()
manufacturer_df.insert(0, 'manufacturer_id', range(1, 1 + len(manufacturer_df)))
manufacturer_df.to_sql(name='manufacturer', con=engine, if_exists='append', index=False)
manufacturer_df.head()

   manufacturer_id manufacturer_name
1                1        Comfy Feet
2                2             asics
3                3              VANS
4                4             ASICS
5                5       ELLIE SHOES

In [30]:
#item_manufacturer
item_manufacturer_df = df[['manufacturer']]
item_manufacturer_df = pd.concat([df['id'], item_manufacturer_df], axis = 1)
item_manufacturer_df = item_manufacturer_df.melt(id_vars = 'id').drop('variable', axis = 1)
item_manufacturer_df.columns = ['item_id', 'manufacturer']
item_manufacturer_df = item_manufacturer_df.dropna()
item_manufacturer_df = pd.merge(item_manufacturer_df, manufacturer_df, how="left", left_on = 'manufacturer', right_on = 'manufacturer_name') 
item_manufacturer_df = item_manufacturer_df.drop(columns=['manufacturer', 'manufacturer_name']) #drop manufacturer column
item_manufacturer_df.to_sql(name='item_manufacturer', con=engine, if_exists='append', index=False)
item_manufacturer_df.head()

                item_id  manufacturer_id
0  AVpiI6RhilAPnD_xBLOs                1
1  AVpf566silAPnD_xkTWM                2
2  AVpfBsxCLJeJML430w57                3
3  AVpfowcKLJeJML43A7Jo                4
4  AVpfc2AwLJeJML439b8c                5

In [31]:
#Categories
categories_list = []

for i in df['categories']:
    categories_list.append(i.split(',')) #first split each row of categories into its own value in lists
    
categories = set()
for i in range(len(categories_list)):
    for p in categories_list[i]:
        categories.add(p) #add each value to set to remove duplicates

In [36]:
from numpy import random 
categories = pd.DataFrame(categories)

input = set()
#generate random 3 digit number as category ID
random.seed(3)
for i in range(100):
    input.add(random.randint(100,999))
    if len(input) == 86:
        break
    
categories.insert(0, 'category_id', list(input))
categories.columns = ['category_id', 'category_name']
categories.to_sql(name = 'categories', con = engine, if_exists = 'append', index = False)
categories.head()

   category_id         category_name
0          513         Women's Boots
1          514                 Women
2          521   Shoes & Accessories
3          522      All Womens Flats
4          523             Halloween

In [33]:
#Prices_Offer
prices_offer = df['prices.offer'].str.split(':', 1, expand=True) # split string by ':' delimiter, expand split to more columns 
prices_offer = pd.concat([df['id'], prices_offer], axis = 1)
prices_offer.columns = ['item_id', 'discount_type', 'discount_percentage']
prices_offer.drop_duplicates(inplace = True)
prices_offer.to_sql(name = 'prices_offer', con = engine, if_exists = 'append', index = False)
prices_offer.head()

                item_id discount_type discount_percentage
0  AWpyySsJAGTnQPR7wNt4   Online only                None
1  AWpyyyb3AGTnQPR7wN-u   Online only                None
2  AWpyzlajAGTnQPR7wOX8   Online only                None
3  AWpyxomE0U_gzG0hkA1q   Online only             20% off
4  AWpyxChWJbEilcB6RhWx   Online only             50% off

In [34]:
#Item_category
item_category = df['categories'].str.split(',', 15, expand=True) #split categories column 
item_category = pd.concat([df['id'], item_category], axis = 1) #add item id back
item_category = item_category.melt(id_vars = 'id').drop('variable', axis = 1) #pivot longer so that each row is item-category
item_category.columns = ['item_id', 'category_name']
item_category = item_category.dropna()

item_category= item_category.merge(categories) #add category id back
item_category.drop('category_name', axis = 1, inplace = True)
item_category.drop_duplicates(inplace = True)

item_category.to_sql(name = 'item_category', con = engine, if_exists = 'append', index = False)
item_category.head()

                item_id  category_id
0  AWpyySsJAGTnQPR7wNt4          972
1  AWpyyyb3AGTnQPR7wN-u          972
2  AWpyzlajAGTnQPR7wOX8          972
3  AWpyxomE0U_gzG0hkA1q          972
4  AWpyxChWJbEilcB6RhWx          972